; domain
(define (domain Depot)
(:requirements :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z))))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))

)

; problem
(define (problem depotprob9876) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 crate13 crate14 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear crate12)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear crate4)
	(at pallet4 distributor1)
	(clear crate14)
	(at pallet5 distributor2)
	(clear crate13)
	(at truck0 distributor1)
	(at truck1 depot1)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at crate0 distributor2)
	(on crate0 pallet5)
	(at crate1 depot1)
	(on crate1 pallet1)
	(at crate2 distributor0)
	(on crate2 pallet3)
	(at crate3 distributor2)
	(on crate3 crate0)
	(at crate4 distributor0)
	(on crate4 crate2)
	(at crate5 depot1)
	(on crate5 crate1)
	(at crate6 distributor2)
	(on crate6 crate3)
	(at crate7 distributor2)
	(on crate7 crate6)
	(at crate8 distributor2)
	(on crate8 crate7)
	(at crate9 distributor2)
	(on crate9 crate8)
	(at crate10 depot1)
	(on crate10 crate5)
	(at crate11 distributor1)
	(on crate11 pallet4)
	(at crate12 depot1)
	(on crate12 crate10)
	(at crate13 distributor2)
	(on crate13 crate9)
	(at crate14 distributor1)
	(on crate14 crate11)
)

(:goal (and
		(on crate0 pallet4)
		(on crate1 crate12)
		(on crate2 crate0)
		(on crate3 crate9)
		(on crate5 pallet0)
		(on crate6 crate2)
		(on crate9 pallet2)
		(on crate10 crate13)
		(on crate12 pallet5)
		(on crate13 pallet1)
		(on crate14 crate10)
	)
)(:metric minimize (total-time)))

; plan
1. (lift hoist5 crate13 crate9 distributor2)
   deleted: (at crate13 distributor2) (clear crate13) (available hoist5) (on crate13 crate9)
   added: (lifting hoist5 crate13) (clear crate9)
   goals met: 0 of 11
2. (lift hoist4 crate14 crate11 distributor1)
   deleted: (at crate14 distributor1) (clear crate14) (available hoist4) (on crate14 crate11)
   added: (lifting hoist4 crate14) (clear crate11)
   goals met: 0 of 11
3. (lift hoist1 crate12 crate10 depot1)
   deleted: (at crate12 depot1) (clear crate12) (available hoist1) (on crate12 crate10)
   added: (lifting hoist1 crate12) (clear crate10)
   goals met: 0 of 11
4. (load hoist1 crate12 truck1 depot1)
   deleted: (lifting hoist1 crate12)
   added: (in crate12 truck1) (available hoist1)
   goals met: 0 of 11
5. (lift hoist1 crate10 crate5 depot1)
   deleted: (at crate10 depot1) (clear crate10) (available hoist1) (on crate10 crate5)
   added: (lifting hoist1 crate10) (clear crate5)
   goals met: 0 of 11
6. (load hoist1 crate10 truck1 depot1)
   deleted: (lifting hoist1 crate10)
   added: (in crate10 truck1) (available hoist1)
   goals met: 0 of 11
7. (lift hoist1 crate5 crate1 depot1)
   deleted: (at crate5 depot1) (clear crate5) (available hoist1) (on crate5 crate1)
   added: (lifting hoist1 crate5) (clear crate1)
   goals met: 0 of 11
8. (load hoist1 crate5 truck1 depot1)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck1) (available hoist1)
   goals met: 0 of 11
9. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   goals met: 0 of 11
10. (unload hoist0 crate5 truck1 depot0)
   deleted: (in crate5 truck1) (available hoist0)
   added: (lifting hoist0 crate5)
   goals met: 0 of 11
11. (drop hoist0 crate5 pallet0 depot0)
   deleted: (lifting hoist0 crate5) (clear pallet0)
   added: (available hoist0) (at crate5 depot0) (clear crate5) (on crate5 pallet0)
   goals met: 1 of 11
12. (drive truck1 depot0 distributor2)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor2)
   goals met: 1 of 11
13. (load hoist5 crate13 truck1 distributor2)
   deleted: (lifting hoist5 crate13)
   added: (in crate13 truck1) (available hoist5)
   goals met: 1 of 11
14. (lift hoist5 crate9 crate8 distributor2)
   deleted: (at crate9 distributor2) (clear crate9) (available hoist5) (on crate9 crate8)
   added: (lifting hoist5 crate9) (clear crate8)
   goals met: 1 of 11
15. (load hoist5 crate9 truck1 distributor2)
   deleted: (lifting hoist5 crate9)
   added: (in crate9 truck1) (available hoist5)
   goals met: 1 of 11
16. (lift hoist5 crate8 crate7 distributor2)
   deleted: (at crate8 distributor2) (clear crate8) (available hoist5) (on crate8 crate7)
   added: (lifting hoist5 crate8) (clear crate7)
   goals met: 1 of 11
17. (load hoist5 crate8 truck1 distributor2)
   deleted: (lifting hoist5 crate8)
   added: (in crate8 truck1) (available hoist5)
   goals met: 1 of 11
18. (lift hoist5 crate7 crate6 distributor2)
   deleted: (at crate7 distributor2) (clear crate7) (available hoist5) (on crate7 crate6)
   added: (lifting hoist5 crate7) (clear crate6)
   goals met: 1 of 11
19. (load hoist5 crate7 truck1 distributor2)
   deleted: (lifting hoist5 crate7)
   added: (in crate7 truck1) (available hoist5)
   goals met: 1 of 11
20. (lift hoist5 crate6 crate3 distributor2)
   deleted: (at crate6 distributor2) (clear crate6) (available hoist5) (on crate6 crate3)
   added: (lifting hoist5 crate6) (clear crate3)
   goals met: 1 of 11
21. (load hoist5 crate6 truck1 distributor2)
   deleted: (lifting hoist5 crate6)
   added: (in crate6 truck1) (available hoist5)
   goals met: 1 of 11
22. (lift hoist5 crate3 crate0 distributor2)
   deleted: (at crate3 distributor2) (clear crate3) (available hoist5) (on crate3 crate0)
   added: (lifting hoist5 crate3) (clear crate0)
   goals met: 1 of 11
23. (load hoist5 crate3 truck1 distributor2)
   deleted: (lifting hoist5 crate3)
   added: (in crate3 truck1) (available hoist5)
   goals met: 1 of 11
24. (lift hoist5 crate0 pallet5 distributor2)
   deleted: (at crate0 distributor2) (clear crate0) (available hoist5) (on crate0 pallet5)
   added: (lifting hoist5 crate0) (clear pallet5)
   goals met: 1 of 11
25. (load hoist5 crate0 truck1 distributor2)
   deleted: (lifting hoist5 crate0)
   added: (in crate0 truck1) (available hoist5)
   goals met: 1 of 11
26. (unload hoist5 crate12 truck1 distributor2)
   deleted: (in crate12 truck1) (available hoist5)
   added: (lifting hoist5 crate12)
   goals met: 1 of 11
27. (drop hoist5 crate12 pallet5 distributor2)
   deleted: (lifting hoist5 crate12) (clear pallet5)
   added: (available hoist5) (at crate12 distributor2) (clear crate12) (on crate12 pallet5)
   goals met: 2 of 11
28. (load hoist4 crate14 truck0 distributor1)
   deleted: (lifting hoist4 crate14)
   added: (in crate14 truck0) (available hoist4)
   goals met: 2 of 11
29. (lift hoist4 crate11 pallet4 distributor1)
   deleted: (at crate11 distributor1) (clear crate11) (available hoist4) (on crate11 pallet4)
   added: (lifting hoist4 crate11) (clear pallet4)
   goals met: 2 of 11
30. (drive truck1 distributor2 depot2)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot2)
   goals met: 2 of 11
31. (unload hoist2 crate9 truck1 depot2)
   deleted: (in crate9 truck1) (available hoist2)
   added: (lifting hoist2 crate9)
   goals met: 2 of 11
32. (drop hoist2 crate9 pallet2 depot2)
   deleted: (lifting hoist2 crate9) (clear pallet2)
   added: (available hoist2) (at crate9 depot2) (clear crate9) (on crate9 pallet2)
   goals met: 3 of 11
33. (unload hoist2 crate3 truck1 depot2)
   deleted: (in crate3 truck1) (available hoist2)
   added: (lifting hoist2 crate3)
   goals met: 3 of 11
34. (drive truck1 depot2 distributor1)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor1)
   goals met: 3 of 11
35. (load hoist4 crate11 truck1 distributor1)
   deleted: (lifting hoist4 crate11)
   added: (in crate11 truck1) (available hoist4)
   goals met: 3 of 11
36. (unload hoist4 crate0 truck1 distributor1)
   deleted: (in crate0 truck1) (available hoist4)
   added: (lifting hoist4 crate0)
   goals met: 3 of 11
37. (drop hoist4 crate0 pallet4 distributor1)
   deleted: (lifting hoist4 crate0) (clear pallet4)
   added: (available hoist4) (at crate0 distributor1) (clear crate0) (on crate0 pallet4)
   goals met: 4 of 11
38. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 4 of 11
39. (lift hoist3 crate4 crate2 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist3) (on crate4 crate2)
   added: (lifting hoist3 crate4) (clear crate2)
   goals met: 4 of 11
40. (load hoist3 crate4 truck0 distributor0)
   deleted: (lifting hoist3 crate4)
   added: (in crate4 truck0) (available hoist3)
   goals met: 4 of 11
41. (lift hoist3 crate2 pallet3 distributor0)
   deleted: (at crate2 distributor0) (clear crate2) (available hoist3) (on crate2 pallet3)
   added: (lifting hoist3 crate2) (clear pallet3)
   goals met: 4 of 11
42. (load hoist3 crate2 truck0 distributor0)
   deleted: (lifting hoist3 crate2)
   added: (in crate2 truck0) (available hoist3)
   goals met: 4 of 11
43. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 4 of 11
44. (unload hoist4 crate2 truck0 distributor1)
   deleted: (in crate2 truck0) (available hoist4)
   added: (lifting hoist4 crate2)
   goals met: 4 of 11
45. (drop hoist4 crate2 crate0 distributor1)
   deleted: (lifting hoist4 crate2) (clear crate0)
   added: (available hoist4) (at crate2 distributor1) (clear crate2) (on crate2 crate0)
   goals met: 5 of 11
46. (unload hoist4 crate6 truck1 distributor1)
   deleted: (in crate6 truck1) (available hoist4)
   added: (lifting hoist4 crate6)
   goals met: 5 of 11
47. (drop hoist4 crate6 crate2 distributor1)
   deleted: (lifting hoist4 crate6) (clear crate2)
   added: (available hoist4) (at crate6 distributor1) (clear crate6) (on crate6 crate2)
   goals met: 6 of 11
48. (drop hoist2 crate3 crate9 depot2)
   deleted: (lifting hoist2 crate3) (clear crate9)
   added: (available hoist2) (at crate3 depot2) (clear crate3) (on crate3 crate9)
   goals met: 7 of 11
49. (drive truck0 distributor1 depot1)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot1)
   goals met: 7 of 11
50. (lift hoist1 crate1 pallet1 depot1)
   deleted: (at crate1 depot1) (clear crate1) (available hoist1) (on crate1 pallet1)
   added: (lifting hoist1 crate1) (clear pallet1)
   goals met: 7 of 11
51. (load hoist1 crate1 truck0 depot1)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck0) (available hoist1)
   goals met: 7 of 11
52. (drive truck1 distributor1 distributor2)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor2)
   goals met: 7 of 11
53. (drive truck1 distributor2 depot1)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot1)
   goals met: 7 of 11
54. (unload hoist1 crate13 truck1 depot1)
   deleted: (in crate13 truck1) (available hoist1)
   added: (lifting hoist1 crate13)
   goals met: 7 of 11
55. (drop hoist1 crate13 pallet1 depot1)
   deleted: (lifting hoist1 crate13) (clear pallet1)
   added: (available hoist1) (at crate13 depot1) (clear crate13) (on crate13 pallet1)
   goals met: 8 of 11
56. (unload hoist1 crate10 truck1 depot1)
   deleted: (in crate10 truck1) (available hoist1)
   added: (lifting hoist1 crate10)
   goals met: 8 of 11
57. (drop hoist1 crate10 crate13 depot1)
   deleted: (lifting hoist1 crate10) (clear crate13)
   added: (available hoist1) (at crate10 depot1) (clear crate10) (on crate10 crate13)
   goals met: 9 of 11
58. (unload hoist1 crate14 truck0 depot1)
   deleted: (in crate14 truck0) (available hoist1)
   added: (lifting hoist1 crate14)
   goals met: 9 of 11
59. (drop hoist1 crate14 crate10 depot1)
   deleted: (lifting hoist1 crate14) (clear crate10)
   added: (available hoist1) (at crate14 depot1) (clear crate14) (on crate14 crate10)
   goals met: 10 of 11
60. (drive truck0 depot1 distributor2)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor2)
   goals met: 10 of 11
61. (unload hoist5 crate1 truck0 distributor2)
   deleted: (in crate1 truck0) (available hoist5)
   added: (lifting hoist5 crate1)
   goals met: 10 of 11
62. (drop hoist5 crate1 crate12 distributor2)
   deleted: (lifting hoist5 crate1) (clear crate12)
   added: (available hoist5) (at crate1 distributor2) (clear crate1) (on crate1 crate12)
   goals met: 11 of 11
